// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПростоОшибка(Команда)
	ВызватьИсключение "Ошибка";
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаПринтера(Команда)
	ВызватьИсключение("Принтер недоступен", КатегорияОшибки.ОшибкаРаботыСПринтером);
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаСети(Команда)
	ОшибкаСетиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НарушениеПравДоступа(Команда)
	НарушениеПравДоступаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаВычислений(Команда)
	А = 1 / 0;
КонецПроцедуры

&НаКлиенте
Процедура ПростоОшибкаНаСервере(Команда)
	ПростоОшибкаНаСервереНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерехватИсключения(Команда)
	ПерехватИсключенияНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерехватИсключенияНаСервере()
	
	Попытка
		ПростоОшибкаНаСервереНаСервере();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Если ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(КатегорияОшибки.ОшибкаСети) Тогда
			Сообщить("Попробуйте позднее");
		Иначе
			ВызватьИсключение("Перехватили не ошибку сети",,, "Для администратора",ИнформацияОбОшибке);
		КонецЕсли;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ПростоОшибкаНаСервереНаСервере()
	ВызватьИсключение "Ошибка";
КонецПроцедуры

&НаСервере
Процедура НарушениеПравДоступаНаСервере()
	ВызватьИсключение("Нет прав на нажатие этой кнопки", КатегорияОшибки.НарушениеПравДоступа,, 
		"Пояснение для администратора");
КонецПроцедуры

&НаСервере
Процедура ОшибкаСетиНаСервере()
	ВызватьИсключение("Удаленный сервер не отвечает", КатегорияОшибки.ОшибкаСети);
КонецПроцедуры

#КонецОбласти
