// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользвовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
	ПользвовательИБ.УникальныйИдентификатор);
	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
	
	Если не ЗначениеЗаполнено(Пользователь) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найден текущий пользователь в справочнике пользователи, обратитесь к Администратору";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
